network_basics/non-pro/coursework.html
<!DOCTYPE html>
<html>
<head>
<!-- 2016-10-21 Fri 19:51 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>《计算机网络基础》课程作业及要求</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="王晓林">
<link rel="stylesheet" href="http://cs2.swfu.edu.cn/org-info-js/org-manual.css" type="text/css">

</head>
<body>
<div id="content">
<h1 class="title">《计算机网络基础》课程作业及要求</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. 作业要求</a></li>
<li><a href="#orgheadline2">2. 作业内容</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> 作业要求</h2>
<div class="outline-text-2" id="text-1">
<p>
各写各的，不许互相抄。若闻到抄袭的味道，严惩不贷！
</p>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> 作业内容</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>注册一个<a href="http://gmail.com/">Gmail</a>帐号，给我发一个邮件，告诉我在网络技术和网络应用方面，你想了解些什么？未来是否想在网络方向上有所发展？</li>
<li>在<a href="https://www.google.com/calendar/">Google Calendar</a>上创建一个新日历，名字叫Coursework或者叫“作业”，日历里要体现出你完成本作业的详细计划，也就是说，要标明你准备在哪些天的哪些个时间段来完成哪些东西。然后把这个日历共享给我和其它同学。注意，共享时只给我和其它同学查看的权限，不要给我们修改的权限，以免节外生枝。 如果你把权限搞错了，说明你不能熟练使用Google calendar，我将会严厉扣分！</li>
<li><p>
用<a href="https://docs.google.com/">google docs</a>写一篇不少于1000字的东西。题目嘛……我鼓励大家自己定题目，但要围绕互联网，比如：
</p>
<ul class="org-ul">
<li>对各个浏览器的使用心得</li>
<li>我为什么坚持用IE</li>
<li>我为什么改用Firefox</li>
<li>我为什么喜欢Google Chrome</li>
<li>对各个操作系统的使用心得</li>
<li>我为什么非用Windows不可</li>
<li>我为什么改用Linux</li>
<li>我和我的电脑</li>
<li>我和互联网</li>
<li>我和Google</li>
<li>我和……随便什么东西</li>
<li>计算机网络基础 &#x2014; 我噩梦般的上课经历</li>
<li>为了爱国，我支持百度</li>
<li>为了自由，我天天翻墙</li>
<li>……</li>
</ul>
<p>
把你这篇大作共享给我和其它同学。注意，共享时只给我和其它同学查看的权限，不要给我们修改的权限，以免节外生枝。如果你把权限搞错了，说明你不能熟练使用Google docs，我将会严厉扣分！
</p></li>

<li>把你写的东西通过<a href="https://plus.google.com/">Google Plus</a>共享出来，让我和其它同学可以看到。当然，胆大的话，也可以共享给全世界。</li>
<li>在<a href="http://maps.google.com/">Google Maps</a>上找到你家，越具体越好，然后共享给我，便于轰炸。
或者把你拍的得意照片放到<a href="https://photos.google.com/">Google Photos</a> 上，然后共享给我。</li>
<li>如果你有自己的<a href="https://sites.google.com/">Google Sites</a>, 记得向我炫耀，我好给你加分。</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 王晓林</p>
<p class="date">Created: 2016-10-21 Fri 19:51</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
